In [33]:
import pandas as pd
import numpy as np

# TheMovieDB.org - tmdb.movies.csv

*only movies from 2010-2018

*from https://developers.themoviedb.org/3/discover/movie-discover

In [2]:
tmdb_df = pd.read_csv("data/tmdb.movies.csv.gz")
tmdb_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [3]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

# TheMovieDB.org - tn.movie_budgets.csv

*includes all movies from https://www.the-numbers.com/movie/budgets/all

In [4]:
tn_budgets_df = pd.read_csv("data/tn.movie_budgets.csv.gz")
tn_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [5]:
tn_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.1+ KB

# IMDB Title Basics

In [7]:
imdb_title_basics_df = pd.read_csv('data/imdb.title.basics.csv.gz')
imdb_title_basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [8]:
imdb_title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [9]:
#imdb_title_basics_df.join(tn_budgets_df, how="left")

In [10]:
imdb_title_basics_df = imdb_title_basics_df.rename(columns = {'primary_title': 'movie', "release_date": "start_year"})
imdb_title_basics_df.head()

,tconst,movie,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [11]:
tn_budgets_df["start_year"] = tn_budgets_df.release_date.map(lambda x: int(x[-4:]))
tn_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,start_year
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279",2009
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",2011
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",2019
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",2015
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",2017

In [12]:
total_df = pd.merge(imdb_title_basics_df, tn_budgets_df, on=["movie", "start_year"])

In [13]:
total_df.head()

,tconst,movie,original_title,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross
0,tt0249516,Foodfight!,Foodfight!,2012,91.0,"Action,Animation,Comedy",26,"Dec 31, 2012","$45,000,000",$0,"$73,706"
1,tt0359950,The Secret Life of Walter Mitty,The Secret Life of Walter Mitty,2013,114.0,"Adventure,Comedy,Drama",37,"Dec 25, 2013","$91,000,000","$58,236,838","$187,861,183"
2,tt0365907,A Walk Among the Tombstones,A Walk Among the Tombstones,2014,114.0,"Action,Crime,Drama",67,"Sep 19, 2014","$28,000,000","$26,017,685","$62,108,587"
3,tt0369610,Jurassic World,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",34,"Jun 12, 2015","$215,000,000","$652,270,625","$1,648,854,864"
4,tt0376136,The Rum Diary,The Rum Diary,2011,119.0,"Comedy,Drama",16,"Oct 28, 2011","$45,000,000","$13,109,815","$21,544,732"

In [14]:
total_df = total_df.drop("original_title", axis=1)

In [15]:
total_df.production_budget = total_df.production_budget.map(lambda x: x.replace("$", ""))

In [16]:
total_df.production_budget = total_df.production_budget.map(lambda x: x.replace(",", ""))

In [17]:
total_df.domestic_gross = total_df.domestic_gross.map(lambda x: x.replace("$", ""))

In [18]:
total_df.domestic_gross = total_df.domestic_gross.map(lambda x: x.replace(",", ""))

In [19]:
total_df.worldwide_gross = total_df.worldwide_gross.map(lambda x: x.replace("$", ""))

In [23]:
total_df.worldwide_gross = total_df.worldwide_gross.map(lambda x: x.replace(",", ""))

In [24]:
total_df.production_budget = total_df.production_budget.map(lambda x: int(x))

In [25]:
total_df.domestic_gross = total_df.domestic_gross.map(lambda x: int(x))

In [26]:
total_df.worldwide_gross = total_df.worldwide_gross.map(lambda x: int(x))

In [27]:
total_df.head()

,tconst,movie,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross
0,tt0249516,Foodfight!,2012,91.0,"Action,Animation,Comedy",26,"Dec 31, 2012",45000000,0,73706
1,tt0359950,The Secret Life of Walter Mitty,2013,114.0,"Adventure,Comedy,Drama",37,"Dec 25, 2013",91000000,58236838,187861183
2,tt0365907,A Walk Among the Tombstones,2014,114.0,"Action,Crime,Drama",67,"Sep 19, 2014",28000000,26017685,62108587
3,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",34,"Jun 12, 2015",215000000,652270625,1648854864
4,tt0376136,The Rum Diary,2011,119.0,"Comedy,Drama",16,"Oct 28, 2011",45000000,13109815,21544732

In [28]:
total_df['ROI'] = total_df.worldwide_gross - total_df.production_budget

In [29]:
total_df.head()

,tconst,movie,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross,ROI
0,tt0249516,Foodfight!,2012,91.0,"Action,Animation,Comedy",26,"Dec 31, 2012",45000000,0,73706,-44926294
1,tt0359950,The Secret Life of Walter Mitty,2013,114.0,"Adventure,Comedy,Drama",37,"Dec 25, 2013",91000000,58236838,187861183,96861183
2,tt0365907,A Walk Among the Tombstones,2014,114.0,"Action,Crime,Drama",67,"Sep 19, 2014",28000000,26017685,62108587,34108587
3,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",34,"Jun 12, 2015",215000000,652270625,1648854864,1433854864
4,tt0376136,The Rum Diary,2011,119.0,"Comedy,Drama",16,"Oct 28, 2011",45000000,13109815,21544732,-23455268

In [37]:
total_df.sort_values("ROI", ascending=False)

,tconst,movie,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross,ROI
1336,tt4154756,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi",7,"Apr 27, 2018",300000000,678815482,2048134200,1748134200
3,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",34,"Jun 12, 2015",215000000,652270625,1648854864,1433854864
1110,tt2820852,Furious 7,2015,137.0,"Action,Crime,Thriller",67,"Apr 3, 2015",190000000,353007020,1518722794,1328722794
82,tt0848228,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi",27,"May 4, 2012",225000000,623279547,1517935897,1292935897
731,tt1825683,Black Panther,2018,134.0,"Action,Adventure,Sci-Fi",42,"Feb 16, 2018",200000000,700059566,1348258224,1148258224
1420,tt4881806,Jurassic World: Fallen Kingdom,2018,128.0,"Action,Adventure,Sci-Fi",13,"Jun 22, 2018",170000000,417719760,1305772799,1135772799
960,tt2294629,Frozen,2013,102.0,"Adventure,Animation,Comedy",56,"Nov 22, 2013",150000000,400738009,1272469910,1122469910
1103,tt2771200,Beauty and the Beast,2017,129.0,"Family,Fantasy,Musical",35,"Mar 17, 2017",160000000,504014165,1259199706,1099199706
958,tt2293640,Minions,2015,91.0,"Adventure,Animation,Comedy",73,"Jul 10, 2015",74000000,336045770,1160336173,1086336173
1014,tt2395427,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi",4,"May 1, 2015",330600000,459005868,1403013963,1072413963
1256,tt3606756,Incredibles 2,2018,118.0,"Action,Adventure,Animation",44,"Jun 15, 2018",200000000,608581744,1242520711,1042520711
305,tt1300854,Iron Man 3,2013,130.0,"Action,Adventure,Sci-Fi",48,"May 3, 2013",200000000,408992272,1215392272,1015392272
444,tt1477834,Aquaman,2018,143.0,"Action,Adventure,Fantasy",36,"Dec 21, 2018",160000000,335061807,1146894640,986894640
1386,tt4630562,The Fate of the Furious,2017,136.0,"Action,Crime,Thriller",23,"Apr 14, 2017",250000000,225764765,1234846267,984846267
1225,tt3469046,Despicable Me 3,2017,89.0,"Adventure,Animation,Comedy",30,"Jun 30, 2017",75000000,264624300,1034727750,959727750
1335,tt4154664,Captain Marvel,2019,123.0,"Action,Adventure,Sci-Fi",96,"Mar 8, 2019",175000000,426525952,1123061550,948061550
380,tt1399103,Transformers: Dark of the Moon,2011,154.0,"Action,Adventure,Sci-Fi",64,"Jun 29, 2011",195000000,352390543,1123790543,928790543
161,tt1074638,Skyfall,2012,143.0,"Action,Adventure,Thriller",52,"Nov 8, 2012",200000000,304360277,1110526981,910526981
637,tt1690953,Despicable Me 2,2013,98.0,"Adventure,Animation,Comedy",22,"Jul 3, 2013",76000000,368065385,975216835,899216835
874,tt2109248,Transformers: Age of Extinction,2014,165.0,"Action,Adventure,Sci-Fi",37,"Jun 27, 2014",210000000,245439076,1104039076,894039076
1229,tt3498820,Captain America: Civil War,2016,147.0,"Action,Adventure,Sci-Fi",17,"May 6, 2016",250000000,408084349,1140069413,890069413
956,tt2283362,Jumanji: Welcome to the Jungle,2017,119.0,"Action,Adventure,Comedy",38,"Dec 20, 2017",90000000,404508916,964496193,874496193
1136,tt2948356,Zootopia,2016,108.0,"Adventure,Animation,Comedy",57,"Mar 4, 2016",150000000,341268248,1019429616,869429616
14,tt0435761,Toy Story 3,2010,103.0,"Adventure,Animation,Comedy",47,"Jun 18, 2010",200000000,415004880,1068879522,868879522
1283,tt3748528,Rogue One: A Star Wars Story,2016,133.0,"Action,Adventure,Sci-Fi",45,"Dec 16, 2016",200000000,532177324,1049102856,849102856
672,tt1727824,Bohemian Rhapsody,2018,134.0,"Biography,Drama,Music",84,"Nov 2, 2018",55000000,216303339,894985342,839985342
132,tt1014759,Alice in Wonderland,2010,108.0,"Adventure,Family,Fantasy",51,"Mar 5, 2010",200000000,334191110,1025491110,825491110
133,tt2049386,Alice in Wonderland,2010,99.0,"Fantasy,Musical",51,"Mar 5, 2010",200000000,334191110,1025491110,825491110
950,tt2277860,Finding Dory,2016,97.0,"Adventure,Animation,Comedy",46,"Jun 17, 2016",200000000,486295561,1021215193,821215193
1091,tt2709768,The Secret Life of Pets,2016,87.0,"Adventure,Animation,Comedy",26,"Jul 8, 2016",75000000,368384330,886750534,811750534
...,...,...,...,...,...,...,...,...,...,...,...
1192,tt3289724,Welcome to Marwen,2018,116.0,"Biography,Comedy,Drama",18,"Dec 21, 2018",45000000,10763520,12874922,-32125078
725,tt1817771,Freaks of Nature,2015,92.0,"Comedy,Horror,Sci-Fi",83,"Oct 30, 2015",33000000,70958,70958,-32929042
154,tt1053810,The Big Year,2011,100.0,Comedy,74,"Oct 14, 2011",41000000,7204138,7684524,-33315476
754,tt1860357,Deepwater Horizon,2016,107.0,"Action,Drama,History",47,"Sep 30, 2016",156000000,61433527,122603824,-33396176
140,tt1032751,The Warrior's Way,2010,100.0,"Action,Fantasy,Western",65,"Dec 3, 2010",42000000,5666340,8514325,-33485675
630,tt1674784,Trespass,2011,91.0,"Crime,Drama,Thriller",54,"Oct 14, 2011",35000000,16816,786532,-34213468
809,tt1972591,King Arthur: Legend of the Sword,2017,126.0,"Action,Adventure,Drama",11,"May 12, 2017",175000000,39175066,139630336,-35369664
162,tt1075747,Jonah Hex,2010,81.0,"Action,Drama,Fantasy",40,"Jun 18, 2010",47000000,10547117,11022696,-35977304
847,tt2032572,USS Indianapolis: Men of Courage,2016,128.0,"Action,Drama,History",40,"Nov 11, 2016",40000000,0,1663785,-38336215
1304,tt3864056,The Goldfinch,2019,NaN,Drama,43,"Sep 13, 2019",40000000,0,0,-40000000
134,tt1014763,Child 44,2015,137.0,"Crime,Drama,History",2,"Apr 17, 2015",50000000,1224330,8004221,-41995779
995,tt2361317,Live by Night,2016,129.0,"Action,Crime,Drama",17,"Dec 25, 2016",65000000,10378555,21774432,-43225568
0,tt0249516,Foodfight!,2012,91.0,"Action,Animation,Comedy",26,"Dec 31, 2012",45000000,0,73706,-44926294
1130,tt2935510,Ad Astra,2019,NaN,"Adventure,Drama,Mystery",9,"Sep 20, 2019",49800000,0,0,-49800000
1525,tt7134096,The Rhythm Section,2019,NaN,"Action,Mystery,Thriller",8,"Nov 22, 2019",50000000,0,0,-50000000
1093,tt2717822,Blackhat,2015,133.0,"Action,Crime,Thriller",47,"Jan 16, 2015",70000000,8005980,19665004,-50334996
58,tt0790736,R.I.P.D.,2013,96.0,"Action,Adventure,Comedy",55,"Jul 19, 2013",130000000,33618855,79076678,-50923322
1518,tt6924650,Midway,2019,NaN,"Action,Drama,History",53,"Nov 8, 2019",59500000,0,0,-59500000
1042,tt2479478,The Ridiculous 6,2015,119.0,"Comedy,Western",52,"Dec 11, 2015",60000000,0,0,-60000000
1406,tt4743226,Air Strike,2018,120.0,"Action,Adventure,Drama",21,"Oct 26, 2018",65000000,0,516279,-64483721
148,tt1041804,The Nutcracker in 3D,2010,110.0,"Action,Family,Fantasy",79,"Nov 24, 2010",90000000,195459,20466016,-69533984
125,tt10013288,The Promise,2017,NaN,Drama,78,"Apr 21, 2017",90000000,8224288,10551417,-79448583
126,tt4192918,The Promise,2017,NaN,Comedy,78,"Apr 21, 2017",90000000,8224288,10551417,-79448583
128,tt9889072,The Promise,2017,NaN,Drama,78,"Apr 21, 2017",90000000,8224288,10551417,-79448583
127,tt7232438,The Promise,2017,114.0,"Drama,Horror,Thriller",78,"Apr 21, 2017",90000000,8224288,10551417,-79448583
1534,tt7504726,Call of the Wild,2020,NaN,"Adventure,Animation,Family",36,"Feb 21, 2020",82000000,0,0,-82000000
1455,tt5519340,Bright,2017,117.0,"Action,Crime,Fantasy",80,"Dec 13, 2017",90000000,0,0,-90000000
955,tt2283336,Men in Black: International,2019,115.0,"Action,Adventure,Comedy",42,"Jun 14, 2019",110000000,3100000,3100000,-106900000
310,tt1305591,Mars Needs Moms,2011,88.0,"Adventure,Animation,Family",94,"Mar 11, 2011",150000000,21392758,39549758,-110450242
1504,tt6565702,Dark Phoenix,2019,113.0,"Action,Adventure,Sci-Fi",3,"Jun 7, 2019",350000000,42762350,149762350,-200237650

In [39]:
genres_df = total_df.genres.str.split(",", 2, expand=True)

In [40]:
total_df["genre1"] = genres_df[0]
total_df.head()

,tconst,movie,start_year,runtime_minutes,genres,id,release_date,production_budget,domestic_gross,worldwide_gross,ROI,genre1
0,tt0249516,Foodfight!,2012,91.0,"Action,Animation,Comedy",26,"Dec 31, 2012",45000000,0,73706,-44926294,Action
1,tt0359950,The Secret Life of Walter Mitty,2013,114.0,"Adventure,Comedy,Drama",37,"Dec 25, 2013",91000000,58236838,187861183,96861183,Adventure
2,tt0365907,A Walk Among the Tombstones,2014,114.0,"Action,Crime,Drama",67,"Sep 19, 2014",28000000,26017685,62108587,34108587,Action
3,tt0369610,Jurassic World,2015,124.0,"Action,Adventure,Sci-Fi",34,"Jun 12, 2015",215000000,652270625,1648854864,1433854864,Action
4,tt0376136,The Rum Diary,2011,119.0,"Comedy,Drama",16,"Oct 28, 2011",45000000,13109815,21544732,-23455268,Comedy

In [41]:
total_df["genre2"] = genres_df[1]

In [43]:
total_df["genre3"] = genres_df[2]

In [51]:
total_df = total_df.drop("genres", axis=1)

In [52]:
total_df = total_df.drop("tconst", axis=1)

In [54]:
total_df = total_df.drop("id", axis=1)

In [55]:
total_df.head()

,movie,start_year,runtime_minutes,release_date,production_budget,domestic_gross,worldwide_gross,ROI,genre1,genre2,genre3
0,Foodfight!,2012,91.0,"Dec 31, 2012",45000000,0,73706,-44926294,Action,Animation,Comedy
1,The Secret Life of Walter Mitty,2013,114.0,"Dec 25, 2013",91000000,58236838,187861183,96861183,Adventure,Comedy,Drama
2,A Walk Among the Tombstones,2014,114.0,"Sep 19, 2014",28000000,26017685,62108587,34108587,Action,Crime,Drama
3,Jurassic World,2015,124.0,"Jun 12, 2015",215000000,652270625,1648854864,1433854864,Action,Adventure,Sci-Fi
4,The Rum Diary,2011,119.0,"Oct 28, 2011",45000000,13109815,21544732,-23455268,Comedy,Drama,None